_posts/language/2022-04-02-english-confiscate.html
---
layout: post
title: 单词本：confiscate
categories: [language]
tags: [English]
---

<p>
这几天还是继续在学隐私计算、加密技术。
</p>

<p>
Privacy sensitivity is most applicable to home users who own and
control their platform. In an enterprise, the IT department may
control the platform completely and weaken the privacy features. This
discussion is also concerned mostly with remote correlation — it
doesn&rsquo;t consider an attacker who can <b>confiscate</b> a platform.
</p>

<p>
对于自己拥有设备的个人用户对个人数据隐私比较敏感。在企业中，IT 部门完全控制平台设备，隐私功能相对不太关心。书中讨论的也都是远程管理相关的。不太会考虑攻击者能够没收平台设备的情况。
</p>

<p>
这里，看到一个单词 confiscate，这个词是没收、查抄（某人财产）、罚没（某物，尤其指土地）。这个词由两部分组成 con- 是一起、一块的意思。
fiscate 是拉丁语 fiscus 演变来的，fiscus有这些意思：
</p>

<ol class="org-ol">
<li>(罗马人习惯上用以装大额货币的)柳条筐；背篓</li>
<li>(罗马法)皇家私人金库区别于国库或公共金库〔aerarium〕。大概由奥古斯都〔Augustus〕创设，其收入来源包括帝国行省纳税、没收财产〔confiscated property〕和无人认领的土地〔unclaimed land〕。皇家私人金库专设有账目官〔rationibus〕，内尔瓦〔Nerva〕任命了一个专门的裁判官〔praetor〕来解决皇家私人金库和国库之间的纠纷，哈德良〔Hadrian〕设立了财政辩护人〔advocati fisci〕以在法院出庭。随着时间的推移，皇家私人金库日益变得比国库更为重要，它负责支付军队、舰队以及帝国行政活动的薪俸和费用。在法国，这个词与国库并无区别。罗马帝国后期，国库一词遂被fiscus一词吸收，fiscus后就被用以指帝国金库。</li>
</ol>

<p>
合起来，大概就是把私人财产、土地没收到国库的意思了。
</p>

<p>
不好意思，昨天提到的 obfuscate 的词根 fuscus 时，提到 “青海田鼠”“microtus fuscus” fuscus 刚好打错了，写成 fiscus了。这不成了青海国库了么……
</p>

<p>
因为 fiscus 是帝国金库，所有派生出：
</p>
<ul class="org-ul">
<li>fiscal（财政的；国库的；国家岁入的）</li>
<li>fiscal year（财政年度；会计年度）</li>
<li>fiscal and tax policy（财政和税收政策）</li>
</ul>


<p>
最近新闻：
</p>
<ul class="org-ul">
<li>2022-03-28: Florida officials confiscate 75 guns amid spring break
surge: &ldquo;There are no words that can describe the way they have
behaved&rdquo;<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> 春假人群飙升之际，Florida 官方没收了 75 把枪支，官方说“无法描述他们到底要干什么”。</li>
<li>2022-03-27: Durban police confiscate R500k worth of hydroponic
dagga. <sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> 3月27日，南非德班警方没收了价值50万南非兰特（Rand，南非货币）的水培大麻。</li>
</ul>

<p>
总结下：
</p>
<ul class="org-ul">
<li>fiscus 罗马帝国金库</li>
<li>fiscus 拉丁语黑暗的</li>
<li>confiscate 没收</li>
<li>fiscal 财政的</li>
<li>fiscal year 财年</li>
</ul>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://www.cbsnews.com/news/florida-spring-break-condemn-shooting-miami/">https://www.cbsnews.com/news/florida-spring-break-condemn-shooting-miami/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://www.sowetanlive.co.za/news/south-africa/2022-03-27-durban-police-confiscate-r500k-worth-of-hydroponic-dagga/">https://www.sowetanlive.co.za/news/south-africa/2022-03-27-durban-police-confiscate-r500k-worth-of-hydroponic-dagga/</a>
</p></div></div>


</div>
</div>
